DataProcessors/ВетринаПФУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВетринаПФУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Comment>Вибір файлу для вивантаження</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ексель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеВетрины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ROW_NUM</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDPR_Bas</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDPR_Sub</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SERVICE_POINT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OSOB</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DIV_PER_ACC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EIC</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LN_NAME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FN_NAME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SN_NAME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IPN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PASS_SERIAL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PASS_NUMBER</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KATOTTG</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>REGION</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DISTRICT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LOCAL_COMMUNITY</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SETTLEMENT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>STREET</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HOUSE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CASE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>APT_NUM</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>APT_FLOOR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HOUSE_FLOOR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PLZAG</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PLOPAL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ZONE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ZABORG</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RESTRUC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>COD</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TARIF</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>REASON</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UNITS</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BENEFIT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SUBSIDY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDPR_Rep</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CDPR_Rec</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PERIN</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PEROFF</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POST_INDEX</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DEBT_START</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВетринаПФУ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Ексель Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
		Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	ИначеЕсли Объект.ХМЛ Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
		Фильтр = "Табличний документ XML(*.xml)|*.xml";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	Иначе
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
		Фильтр = "Электронная таблица Excel(*.csv)|*.csv";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере()
	ДанныеДляВетрины = Объект.ДанныеВетрины.Выгрузить();
	МассивЛС         = ПолучитьМассивЛС();
	KATOTTG          = "UA53060230010027681";
	КодЯзыкаПечать   = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
	Номер            = 1;
	ЕДРПОУ           = Справочники.Организации.НайтиПоКоду("000000001").КодПоЕДРПОУ;
	ДатаОстатковZ    = НачалоМесяца(ТекущаяДата()) - 1;
	КешТарифов       = Новый Соответствие;
	КешОстатков      = Новый Соответствие;
	Для Каждого стр Из МассивЛС Цикл
		
		ОбщиеДанные             = ВыборДанныхОбщимЗапросом(стр.Ссылка);
		УслугиПоЛС              = ОбщиеДанные[0];
		ОтветственныйВладелецЛС = ОбщиеДанные[1];
		ПлощадиЛС               = ОбщиеДанные[2];
		
		НовСтрока = ДанныеДляВетрины.Добавить();
		НовСтрока.CDPR_BAS = ЕДРПОУ;
		НовСтрока.OSOB     = стр.Ссылка.Наименование;
		
		НовСтрока.POST_INDEX = "37600";
		
		// Відповідальний власник ОР
		ОтветственныйВладелец = Новый Структура;
		ВыборОтветственныйВладелец = ОтветственныйВладелецЛС.Выбрать();
		Пока ВыборОтветственныйВладелец.Следующий() Цикл
			ОтветственныйВладелец.Вставить("ИНН", ВыборОтветственныйВладелец.ИНН);
			ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборОтветственныйВладелец.ФИО, " ");
			Если ФИО.Количество() = 3 Тогда
				ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
				ОтветственныйВладелец.Вставить("Имя", ФИО[1]);
				ОтветственныйВладелец.Вставить("Отчество", ФИО[2]);
			ИначеЕсли ФИО.Количество() = 2 Тогда
				ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
				ОтветственныйВладелец.Вставить("Имя", ФИО[1]);
				ОтветственныйВладелец.Вставить("Отчество", "");
			ИначеЕсли ФИО.Количество() = 1 Тогда
				ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
				ОтветственныйВладелец.Вставить("Имя", "");
				ОтветственныйВладелец.Вставить("Отчество", "");
			КонецЕсли;
		КонецЦикла;
		//НовСтрока.LN_NAME     = ОтветственныйВладелец.Фамилия;
		//НовСтрока.FN_NAME     = ОтветственныйВладелец.Имя;
		//НовСтрока.SN_NAME     = ОтветственныйВладелец.Отчество;
		//НовСтрока.IPN         = ОтветственныйВладелец.ИНН;
		// Кінець Відповідальний власник ОР
		
		НовСтрока.KATOTTG = KATOTTG;
		МассивАдреса = РазложитьСтрокуВМассивПодстрок(стр.Владелец);
		Если МассивАдреса.Количество() <> 0 Тогда
			//НовСтрока.SETTLEMENT = Сред(МассивАдреса[3], 4);
			НовСтрока.STREET     = Сред(МассивАдреса[0], 5);
			НовСтрока.HOUSE      = Сред(МассивАдреса[1], 7);
		КонецЕсли;
		НовСтрока.APT_NUM = стр.Ссылка.ОбъектЛицевогоСчета.Код;
		НовСтрока.APT_FLOOR = стр.Ссылка.ОбъектЛицевогоСчета.Этаж;
		НовСтрока.HOUSE_FLOOR = стр.Владелец.КоличествоЭтажей;
		
		// Площі ОР
		ВыборПлощадиЛС = ПлощадиЛС.Выгрузить();
		Если ВыборПлощадиЛС.Количество() <> 0 Тогда
			Для Каждого стрПлощадь Из ВыборПлощадиЛС Цикл
				Если стрПлощадь.ВидПлощади      = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					НовСтрока.PLZAG  = стрПлощадь.Площадь;
				ИначеЕсли стрПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					НовСтрока.PLOPAL = стрПлощадь.Площадь;
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
		// Кінець Площі ОР
		
		ВыборУслугиЛС = УслугиПоЛС.Выгрузить();
		Для Каждого стрУслуги Из ВыборУслугиЛС Цикл
			Если стрУслуги.Действует = Истина Тогда
				Если НЕ ЗначениеЗаполнено(НовСтрока.COD) Тогда
					НовСтрока.COD = стрУслуги.КодУслугиПФУ;
					//Если стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("233") Тогда
					//	НовСтрока.UNITS = "GKAL";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113") Тогда
					//	НовСтрока.UNITS = "CUBMETER";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда
					//	НовСтрока.UNITS = "KILOWATT";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055") Тогда
					//	НовСтрока.UNITS = "SQMENER";
					//Иначе
					//	НовСтрока.UNITS = "HOUSING";
					//КонецЕсли;
					Если стрУслуги.КодУслугиПФУ = "105" Тогда
						НовСтрока.UNITS = "CUBMETER";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "107.1" Тогда
						НовСтрока.UNITS = "GKAL";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "114" Тогда
						НовСтрока.UNITS = "HOUSING";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "115" Тогда
						НовСтрока.UNITS = "HOUSING";
					КонецЕсли;
				    Тариф = ТарифПоУслугеКеш(стрУслуги.КодУслугиПФУ, стр.Владелец, КешТарифов);
					Если Тариф.Количество() <> 0  Тогда
					    НовСтрока.TARIF = Тариф.ЗначениеТарифа;
					Иначе
						НовСтрока.TARIF = 0;
					КонецЕсли;
					НовСтрока.ZABORG = ОстатокКеш(ДатаОстатковZ, стр.Ссылка, стрУслуги.Услуга, КешОстатков);
					НовСтрока.PERIN = НачалоМесяца(ТекущаяДата());
					НовСтрока.PEROFF = '20501231';
					НовСтрока.ROW_NUM  = Номер;
					НовСтрока.DEBT_START = ДатаНачалаЗадолженностиПоЛицевомуСчету(стр.Ссылка, стрУслуги.Услуга);
					Номер = Номер + 1;
				Иначе
					НовСтрока = ДанныеДляВетрины.Добавить();
					НовСтрока.ROW_NUM  = Номер;
					НовСтрока.CDPR_BAS = ЕДРПОУ;
					НовСтрока.OSOB     = стр.Ссылка.Наименование;
					ОтветственныйВладелец = ОтветственныйВладелец(стр.Ссылка);
					Если ТипЗнч(ОтветственныйВладелец) = Тип("Структура") Тогда
						//НовСтрока.LN_NAME     = ОтветственныйВладелец.Фамилия;
						//НовСтрока.FN_NAME     = ОтветственныйВладелец.Имя;
						//НовСтрока.SN_NAME     = ОтветственныйВладелец.Отчество;
						//НовСтрока.IPN         = ОтветственныйВладелец.ИНН;
					КонецЕсли;
					НовСтрока.KATOTTG = KATOTTG;
					МассивАдреса = РазложитьСтрокуВМассивПодстрок(стр.Владелец);
					Если МассивАдреса.Количество() <> 0 Тогда
					    //НовСтрока.SETTLEMENT = Сред(МассивАдреса[3], 4);
						НовСтрока.STREET     = Сред(МассивАдреса[0], 5);
						НовСтрока.HOUSE      = Сред(МассивАдреса[1], 7);
					КонецЕсли;
					НовСтрока.APT_NUM = стр.Ссылка.ОбъектЛицевогоСчета.Код;
					НовСтрока.APT_FLOOR = стр.Ссылка.ОбъектЛицевогоСчета.Этаж;
					НовСтрока.HOUSE_FLOOR = стр.Владелец.КоличествоЭтажей;
					
					ПлощадиЛС = ПолучитьПлощадьОбъектовЛицевыхСчетов(стр.Ссылка.ОбъектЛицевогоСчета, стр.Владелец);
					Если ПлощадиЛС.Количество() <> 0 Тогда
						Для Каждого стрПлощадь Из ПлощадиЛС Цикл
							Если стрПлощадь.ВидПлощади      = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
								НовСтрока.PLZAG  = стрПлощадь.Площадь;
							ИначеЕсли стрПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
								НовСтрока.PLOPAL = стрПлощадь.Площадь;
							КонецЕсли;				
						КонецЦикла;
					КонецЕсли;
					НовСтрока.COD = стрУслуги.КодУслугиПФУ;
					//Если стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("233") Тогда
					//	НовСтрока.UNITS = "GKAL";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113") Тогда
					//	НовСтрока.UNITS = "CUBMETER";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда
					//	НовСтрока.UNITS = "KILOWATT";
					//ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055") Тогда
					//	НовСтрока.UNITS = "SQMENER";
					//Иначе
					//	НовСтрока.UNITS = "HOUSING";
					//КонецЕсли;
					Если стрУслуги.КодУслугиПФУ = "105" Тогда
						НовСтрока.UNITS = "CUBMETER";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "107.1" Тогда
						НовСтрока.UNITS = "GKAL";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "114" Тогда
						НовСтрока.UNITS = "HOUSING";
					ИначеЕсли стрУслуги.КодУслугиПФУ = "115" Тогда
						НовСтрока.UNITS = "HOUSING";
					КонецЕсли;
				    Тариф = ТарифПоУслугеКеш(стрУслуги.КодУслугиПФУ, стр.Владелец, КешТарифов);
					Если Тариф.Количество() <> 0  Тогда
					    НовСтрока.TARIF = Тариф.ЗначениеТарифа;
					Иначе
						НовСтрока.TARIF = 0;
					КонецЕсли;
					НовСтрока.ZABORG = ОстатокКеш(ДатаОстатковZ, стр.Ссылка, стрУслуги.Услуга, КешОстатков);
					НовСтрока.POST_INDEX = "37600";
					НовСтрока.PERIN = НачалоМесяца(ТекущаяДата());
					НовСтрока.PEROFF = '20501231';
					НовСтрока.DEBT_START = ДатаНачалаЗадолженностиПоЛицевомуСчету(стр.Ссылка, стрУслуги.Услуга);
					
					Номер = Номер + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
	КонецЦикла;
	Объект.ДанныеВетрины.Загрузить(ДанныеДляВетрины);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере1()
	
	ДанныеДляВетрины = Объект.ДанныеВетрины.Выгрузить();
	МассивЛС = ПолучитьМассивЛС();
	KATOTTG = "UA53060230000098362";
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
	ЕДРПОУ1 = Справочники.Организации.НайтиПоКоду("000000001").КодПоЕДРПОУ;
	ДатаОстатковZ1 = НачалоМесяца(ТекущаяДата()) - 1;
	ЕИ233 = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("233");
	ЕИ113 = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113");
	ЕИ214 = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214");
	ЕИ055 = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055");
	КешТарифов1 = Новый Соответствие;
	КешОстатков1 = Новый Соответствие;
	КешВладельца1 = Новый Соответствие;
	КешПлощади1 = Новый Соответствие;
	Для Каждого стр Из МассивЛС Цикл
		
		
		НовСтрока = ДанныеДляВетрины.Добавить();
		НовСтрока.ROW_NUM  = НовСтрока.НомерСтроки;
		НовСтрока.CDPR_BAS = ЕДРПОУ1;
		НовСтрока.OSOB     = стр.Ссылка.Наименование;
		ОтветственныйВладелец = ОтветственныйВладелецКеш(стр.Ссылка, КешВладельца1);
		Если ТипЗнч(ОтветственныйВладелец) = Тип("Структура") Тогда
		    НовСтрока.LN_NAME     = ОтветственныйВладелец.Фамилия;
			НовСтрока.FN_NAME     = ОтветственныйВладелец.Имя;
			НовСтрока.SN_NAME     = ОтветственныйВладелец.Отчество;
			НовСтрока.IPN         = ОтветственныйВладелец.ИНН;
		КонецЕсли;
		НовСтрока.KATOTTG = KATOTTG;
		МассивАдреса = РазложитьСтрокуВМассивПодстрок(стр.Владелец);
		Если МассивАдреса.Количество() <> 0 Тогда
		    НовСтрока.SETTLEMENT = Сред(МассивАдреса[3], 4);
			НовСтрока.STREET     = Сред(МассивАдреса[0], 5);
			НовСтрока.HOUSE      = Сред(МассивАдреса[1], 7);
		КонецЕсли;
		НовСтрока.APT_NUM = стр.Ссылка.ОбъектЛицевогоСчета.Код;
		НовСтрока.APT_FLOOR = стр.Ссылка.ОбъектЛицевогоСчета.Этаж;
		НовСтрока.HOUSE_FLOOR = стр.Владелец.КоличествоЭтажей;
		
		ПлощадиЛС = ПлощадьКеш(стр.Ссылка.ОбъектЛицевогоСчета, стр.Владелец, КешПлощади1);
		Если ПлощадиЛС.Количество() <> 0 Тогда
			Для Каждого стрПлощадь Из ПлощадиЛС Цикл
				Если стрПлощадь.ВидПлощади      = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					НовСтрока.PLZAG  = стрПлощадь.Площадь;
				ИначеЕсли стрПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					НовСтрока.PLOPAL = стрПлощадь.Площадь;
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
		
		УслугиЛС = ПолучитьУслугиПоЛС(стр.Ссылка);
		Для Каждого стрУслуги Из УслугиЛС Цикл
			Если НЕ ЗначениеЗаполнено(НовСтрока.COD) Тогда
				НовСтрока.COD = стрУслуги.КодПФУ;
			    Тариф = ТарифПоУслугеКеш(стрУслуги.КодПФУ, стр.Владелец, КешТарифов1);
				НовСтрока.TARIF = Тариф.ЗначениеТарифа;
				НовСтрока.ZABORG = ОстатокКеш(ДатаОстатковZ1, стр.Ссылка, стрУслуги.Услуга, КешОстатков1);
				НовСтрока.PERIN = НачалоМесяца(ТекущаяДата());
				НовСтрока.PEROFF = '20501231';
			Иначе
				НовСтрока = ДанныеДляВетрины.Добавить();
				НовСтрока.ROW_NUM  = НовСтрока.НомерСтроки;
				НовСтрока.CDPR_BAS = ЕДРПОУ1;
				НовСтрока.OSOB     = стр.Ссылка.Наименование;
				ОтветственныйВладелец = ОтветственныйВладелецКеш(стр.Ссылка, КешВладельца1);
				Если ТипЗнч(ОтветственныйВладелец) = Тип("Структура") Тогда
				    НовСтрока.LN_NAME     = ОтветственныйВладелец.Фамилия;
					НовСтрока.FN_NAME     = ОтветственныйВладелец.Имя;
					НовСтрока.SN_NAME     = ОтветственныйВладелец.Отчество;
					НовСтрока.IPN         = ОтветственныйВладелец.ИНН;
				КонецЕсли;
				НовСтрока.KATOTTG = KATOTTG;
				МассивАдреса = РазложитьСтрокуВМассивПодстрок(стр.Владелец);
				Если МассивАдреса.Количество() <> 0 Тогда
				    НовСтрока.SETTLEMENT = Сред(МассивАдреса[3], 4);
					НовСтрока.STREET     = Сред(МассивАдреса[0], 5);
					НовСтрока.HOUSE      = Сред(МассивАдреса[1], 7);
				КонецЕсли;
				НовСтрока.APT_NUM = стр.Ссылка.ОбъектЛицевогоСчета.Код;
				НовСтрока.APT_FLOOR = стр.Ссылка.ОбъектЛицевогоСчета.Этаж;
				НовСтрока.HOUSE_FLOOR = стр.Владелец.КоличествоЭтажей;
				
				ПлощадиЛС = ПлощадьКеш(стр.Ссылка.ОбъектЛицевогоСчета, стр.Владелец, КешПлощади1);
				Если ПлощадиЛС.Количество() <> 0 Тогда
					Для Каждого стрПлощадь Из ПлощадиЛС Цикл
						Если стрПлощадь.ВидПлощади      = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
							НовСтрока.PLZAG  = стрПлощадь.Площадь;
						ИначеЕсли стрПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
							НовСтрока.PLOPAL = стрПлощадь.Площадь;
						КонецЕсли;				
					КонецЦикла;
				КонецЕсли;
				НовСтрока.COD = стрУслуги.КодПФУ;
				Если стрУслуги.Услуга.ЕдиницаИзмерения = ЕИ233 Тогда
					НовСтрока.UNITS = "GKAL";
				ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = ЕИ113 Тогда
					НовСтрока.UNITS = "CUBMETER";
				ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = ЕИ214 Тогда
					НовСтрока.UNITS = "KILOWATT";
				ИначеЕсли стрУслуги.Услуга.ЕдиницаИзмерения = ЕИ055 Тогда
					НовСтрока.UNITS = "SQMENER";
				КонецЕсли;
			    Тариф = ТарифПоУслугеКеш(стрУслуги.КодПФУ, стр.Владелец, КешТарифов1);
				НовСтрока.TARIF = Тариф.ЗначениеТарифа;
				НовСтрока.ZABORG = ОстатокКеш(ДатаОстатковZ1, стр.Ссылка, стрУслуги.Услуга, КешОстатков1);
				НовСтрока.PERIN = НачалоМесяца(ТекущаяДата());
				НовСтрока.PEROFF = '20501231';
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	Объект.ДанныеВетрины.Загрузить(ДанныеДляВетрины);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанными(Команда)
	ЗаполнитьДаннымиНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЛС(МассивЗданий = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаКон,
		|			ЛицевойСчет.Владелец.Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &Все
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛицевойСчет.Владелец В (&МассивЗданий)
		|				КОНЕЦ) КАК ЛицевыеСчетаСрезПоследних
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует
		|	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код";
	Запрос.УстановитьПараметр("ДатаКон",     НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("МассивЗданий", МассивЗданий);
	Запрос.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	Если МассивЗданий = Неопределено Тогда
		Запрос.УстановитьПараметр("Все", Истина);
	Иначе
		Запрос.УстановитьПараметр("Все", Ложь);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("ЛицевойСчет");
		
КонецФункции

&НаСервере
Функция ПолучитьУслугиПоЛС(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.Действует,
	    |	НазначенныеУслугиСрезПоследних.Период,
	    |	МАКСИМУМ(НазначенныеУслугиСрезПоследних.Период) КАК ДатаОкончанияДействия,
	    |	НазначенныеУслугиСрезПоследних.Услуга,
	    |	НазначенныеУслугиСрезПоследних.Услуга.КодУслугиПФУ КАК КодУслугиПФУ
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.Организация,
	    |	НазначенныеУслугиСрезПоследних.Действует,
	    |	НазначенныеУслугиСрезПоследних.Услуга,
	    |	НазначенныеУслугиСрезПоследних.Период,
	    |	НазначенныеУслугиСрезПоследних.Регистратор";
		
	Запрос.УстановитьПараметр("НаДату",      КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Услуга");
	тз.Колонки.Добавить("КодПФУ");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Действует = Истина Тогда
			НовСтрока = тз.Добавить();
			НовСтрока.Услуга = Выборка.Услуга;
			НовСтрока.КодПФУ = Выборка.КодУслугиПФУ;
		КонецЕсли;
	КонецЦикла;
	тз.Свернуть("КодУслугиПФУ");
	Возврат тз;
	
КонецФункции

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

&НаСервере
Функция ПолучитьПредставлениеАдреса(Массив, Квартира, КодЯзыкаПечать) Экспорт 
	
	СтрокаАдрес = "";
	Сч = Массив.ВГраница();
	Пока НЕ(Сч < 0) Цикл
		Если Сч = 3 Тогда   //Массив.ВГраница()  Тогда
			СтрокаАдрес = Массив[Сч];
		Иначе
			Если Сч = 1 ИЛИ Сч = 0 Тогда
			    СтрокаАдрес = СтрокаАдрес+", "+Массив[Сч];
			КонецЕсли;
		КонецЕсли;
		Сч = Сч-1;
	КонецЦикла;
	//СтрокаАдрес = СтрокаАдрес + ?(Квартира.Подъезд = Справочники.Подъезды.ПустаяСсылка(),"",", "Квартира.Подъезд.Наименование)
			//+ Квартира.Наименование;
      СтрокаАдрес = СтрокаАдрес + ", " + Квартира;
			
			Если КодЯзыкаПечать = "uk" Тогда
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес, "дом","");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Подъезд","");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секция","");
			Иначе
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Під'їз","");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секція","");
			КонецЕсли;
			
	Возврат СтрокаАдрес; 
	
КонецФункции // ПолучитьПредставлениеАдреса()

&НаСервере
Функция ПолучитьТарифПоУслуге(Услуга , Здание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыСрезПоследних.ЗначениеТарифа,
		|	ТарифыСрезПоследних.НормаПотребления,
		|	ТарифыСрезПоследних.ЗначениеТарифаПоНорме
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(
		|			&Период,
		|			Услуга.КодУслугиПФУ = &КодУслугиПФУ
		|				И Здание = &Здание) КАК ТарифыСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КодУслугиПФУ", Услуга);
	Запрос.УстановитьПараметр("Здание", Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Тарифы = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		Тарифы.Вставить("ЗначениеТарифа", Выборка.ЗначениеТарифа);
		Тарифы.Вставить("НормаПотребления", Выборка.НормаПотребления);
		Тарифы.Вставить("ЗначениеТарифаПоНорме", Выборка.ЗначениеТарифаПоНорме);
	КонецЦикла;
    Возврат Тарифы;
	
КонецФункции

&НаСервере
Функция ОтветственныйВладелец(ЛС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.Представление КАК ФИО,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ИНН КАК ИНН
	    |ИЗ
	    |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
	    |			&НаДату,
	    |			Активность = ИСТИНА
	    |				И ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить().Выбрать();
	ОтветственныйВладелец = Новый Структура;
	Пока Результат.Следующий() Цикл
		ОтветственныйВладелец.Вставить("ИНН", Результат.ИНН);
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Результат.ФИО, " ");
		Если ФИО.Количество() = 3 Тогда
			ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
			ОтветственныйВладелец.Вставить("Имя", ФИО[1]);
			ОтветственныйВладелец.Вставить("Отчество", ФИО[2]);
		ИначеЕсли ФИО.Количество() = 2 Тогда
			ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
			ОтветственныйВладелец.Вставить("Имя", ФИО[1]);
			ОтветственныйВладелец.Вставить("Отчество", "");
		ИначеЕсли ФИО.Количество() = 2 Тогда
			ОтветственныйВладелец.Вставить("Фамилия", ФИО[0]);
			ОтветственныйВладелец.Вставить("Имя", "");
			ОтветственныйВладелец.Вставить("Отчество", "");
		КонецЕсли;
	КонецЦикла;
	Возврат ОтветственныйВладелец;
КонецФункции

&НаСервере
Функция ПолучитьПлощадьОбъектовЛицевыхСчетов(Помещение, Здание)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь,
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(
	    |			&НаДату,
	    |			Помещение.Владелец = &Здание
	    |				И Помещение = &Помещение) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьОстатки(НаДату, ЛицевойСчет, Услуга) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВложенныйЗапрос.ЛицевойСчет,
	    |	СУММА(ВложенныйЗапрос.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	    |	СУММА(ВложенныйЗапрос.СуммаНачисления) КАК СуммаНачисления,
	    |	СУММА(ВложенныйЗапрос.СуммаОплаты) КАК СуммаОплаты,
	    |	СУММА(ВложенныйЗапрос.Льготы) КАК Льготы,
	    |	СУММА(ВложенныйЗапрос.Субсидия) КАК Субсидия,
	    |	СУММА(ВложенныйЗапрос.Перерасчет) КАК Перерасчет
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК СуммаНачисления,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК СуммаОплаты,
	    |		0 КАК Льготы,
	    |		0 КАК Субсидия,
	    |		0 КАК Перерасчет,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.ВидУслуги КАК УслугаВидУслуги
	    |	ИЗ
	    |		РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, , ЛицевойСчет.ПометкаУдаления = ЛОЖЬ) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |	ГДЕ
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.КодУслугиПФУ = &КодУслугиПФУ
	    |	
	    |	СГРУППИРОВАТЬ ПО
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодГод,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход,
	    |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.ВидУслуги
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	    |		0,
	    |		0,
	    |		0,
	    |		СУММА(ВЫБОР
	    |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	    |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |				ИНАЧЕ 0
	    |			КОНЕЦ),
	    |		ВЫБОР
	    |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	    |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ,
	    |		СУММА(ВЫБОР
	    |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	    |						ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	    |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |				ИНАЧЕ 0
	    |			КОНЕЦ),
	    |		РасчетыПоЛицевымСчетам.Услуга.ВидУслуги
	    |	ИЗ
	    |		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |	ГДЕ
	    |		РасчетыПоЛицевымСчетам.ЛицевойСчет.ПометкаУдаления = ЛОЖЬ
	    |		И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	    |		И РасчетыПоЛицевымСчетам.Услуга.КодУслугиПФУ = &КодУслугиПФУ
	    |	
	    |	СГРУППИРОВАТЬ ПО
	    |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	    |		ВЫБОР
	    |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	    |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	    |			ИНАЧЕ 0
	    |		КОНЕЦ,
	    |		РасчетыПоЛицевымСчетам.Услуга.ВидУслуги) КАК ВложенныйЗапрос
	    |ГДЕ
	    |	ВложенныйЗапрос.ЛицевойСчет = &ЛицевойСчет
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ВложенныйЗапрос.ЛицевойСчет";
	Запрос.УстановитьПараметр("ДатаНачала", '20221001');
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(НаДату));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("КодУслугиПФУ", Услуга);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	    Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сумма = Выборка.СуммаНачисления - Выборка.СуммаОплаты;
		КонецЦикла;
		Если Сумма < 0 Тогда
			Сумма = 0;
		КонецЕсли;
	КонецЕсли;
	Возврат Сумма;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	Разделитель = ";";
	Текст = "";
	Таблица = Объект.ДанныеВетрины;
	
	Для Каждого Запись Из Таблица Цикл
		Если Текст = "" Тогда
			Текст = СоздатьЗаголовки(Таблица, Разделитель) + Символы.ПС;
		КонецЕсли;
		Текст = Текст + Запись.НомерСтроки + Разделитель + Запись.CDPR_Bas + Разделитель + Запись.CDPR_Sub + Разделитель + Запись.SERVICE_POINT + Разделитель +
		        Запись.OSOB + Разделитель + Запись.DIV_PER_ACC + Разделитель + Запись.EIC + Разделитель + Запись.LN_NAME + Разделитель + Запись.FN_NAME +
				Разделитель + Запись.SN_NAME + Разделитель + Запись.IPN + Разделитель + Запись.PASS_SERIAL + Разделитель + Запись.PASS_NUMBER + Разделитель +
				Запись.KATOTTG + Разделитель + Запись.REGION + Разделитель + Запись.DISTRICT + Разделитель + Запись.LOCAL_COMMUNITY + Разделитель +
				Запись.SETTLEMENT + Разделитель + Запись.STREET + Разделитель + Запись.HOUSE + Разделитель + Запись.CASE + Разделитель + Запись.APT_NUM +
				Разделитель + Запись.APT_FLOOR + Разделитель + Запись.HOUSE_FLOOR + Разделитель + Запись.PLZAG + Разделитель + Запись.PLOPAL + Разделитель +
				Запись.ZONE + Разделитель + Запись.ZABORG + Разделитель + Запись.RESTRUC + Разделитель + Запись.COD + Разделитель + Запись.TARIF + Разделитель +
				Запись.REASON + Разделитель + Запись.UNITS + Разделитель + Запись.BENEFIT + Разделитель + Запись.SUBSIDY + Разделитель + Запись.CDPR_Rep +
				Разделитель + Запись.CDPR_Rec + Разделитель + Запись.PERIN + Разделитель + Запись.PEROFF + Разделитель + Запись.POST_INDEX + Запись.DEBT_START;
	КонецЦикла;
	Кодировка = КодировкаТекста.ANSI;
	ТекстовыйФайлЗапись = Новый ЗаписьТекста(Объект.Файл, Кодировка);
	ТекстовыйФайлЗапись.Записать(Текст);
	ТекстовыйФайлЗапись.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаголовки(ТаблицаДокументов, Разделитель)
	НоваяТаблица = ТаблицаДокументов.Выгрузить();
	КолонкиТЗ = НоваяТаблица.Колонки;
	Для каждого Колонка Из КолонкиТЗ Цикл
		Если Колонка.Имя = "НомерСтроки" ИЛИ Колонка.Имя = "ИсходныйНомерСтроки" Тогда
			Продолжить;
		Иначе
		    СтрКолонки = "" + СтрКолонки + Колонка.Имя + Разделитель;
		КонецЕсли;
	КонецЦикла; 
	Возврат СтрКолонки;
КонецФункции

&НаСервере
Функция ВыборДанныхОбщимЗапросом(ЛицевойСчет)

	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.Действует,
	    |	НазначенныеУслугиСрезПоследних.Период,
	    |	МАКСИМУМ(НазначенныеУслугиСрезПоследних.Период) КАК ДатаОкончанияДействия,
	    |	НазначенныеУслугиСрезПоследних.Услуга,
	    |	НазначенныеУслугиСрезПоследних.Услуга.КодУслугиПФУ КАК КодУслугиПФУ
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.Организация,
	    |	НазначенныеУслугиСрезПоследних.Действует,
	    |	НазначенныеУслугиСрезПоследних.Услуга,
	    |	НазначенныеУслугиСрезПоследних.Период,
	    |	НазначенныеУслугиСрезПоследних.Регистратор,
	    |	НазначенныеУслугиСрезПоследних.Услуга.КодУслугиПФУ
	    |;
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.Представление КАК ФИО,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ИНН КАК ИНН
	    |ИЗ
	    |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
	    |			&НаДату,
	    |			Активность = ИСТИНА
	    |				И ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	    |;
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь,
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(
	    |			&НаДату,
	    |			Помещение.Владелец = &Здание
	    |				И Помещение = &Помещение) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("НаДату", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
	Запрос.УстановитьПараметр("Помещение", ЛицевойСчет.ОбъектЛицевогоСчета);

	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&НаСервере
Функция ТарифПоУслугеКеш(КодУслугиПФУ, Здание, Кеш)
	Ключ = Строка(КодУслугиПФУ) + "|" + Строка(Здание.УникальныйИдентификатор());
	Рез = Кеш.Получить(Ключ);
	Если Рез = Неопределено Тогда
		Рез = ПолучитьТарифПоУслуге(КодУслугиПФУ, Здание);
		Кеш.Вставить(Ключ, Рез);
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция ОстатокКеш(НаДату, ЛицевойСчет, Услуга, Кеш)
	Ключ = Строка(НаДату) + "|" + Строка(ЛицевойСчет.УникальныйИдентификатор()) + "|" + Строка(Услуга.УникальныйИдентификатор());
	Рез = Кеш.Получить(Ключ);
	Если Рез = Неопределено Тогда
		Рез = ПолучитьОстатки(НаДату, ЛицевойСчет, Услуга);
		Кеш.Вставить(Ключ, Рез);
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция ОтветственныйВладелецКеш(ЛС, Кеш)
	Ключ = Строка(ЛС.УникальныйИдентификатор());
	Рез = Кеш.Получить(Ключ);
	Если Рез = Неопределено Тогда
		Рез = ОтветственныйВладелец(ЛС);
		Кеш.Вставить(Ключ, Рез);
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПлощадьКеш(Помещение, Здание, Кеш)
	Ключ = Строка(Помещение.УникальныйИдентификатор());
	Рез = Кеш.Получить(Ключ);
	Если Рез = Неопределено Тогда
		Рез = ПолучитьПлощадьОбъектовЛицевыхСчетов(Помещение, Здание);
		Кеш.Вставить(Ключ, Рез);
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция ВыгрузитьВФайлЕксельНаСервере(Таб)
	
	ДанныеДляВыгрузки = Объект.ДанныеВетрины.Выгрузить(,"ROW_NUM, CDPR_Bas, CDPR_Sub, SERVICE_POINT, OSOB, DIV_PER_ACC, EIC, LN_NAME, FN_NAME, SN_NAME, IPN, PASS_SERIAL, PASS_NUMBER, KATOTTG, REGION, DISTRICT, LOCAL_COMMUNITY, SETTLEMENT, STREET, HOUSE, CASE, APT_NUM, APT_FLOOR, HOUSE_FLOOR, PLZAG, PLOPAL, ZONE, ZABORG, RESTRUC, COD, TARIF, REASON, UNITS, BENEFIT, SUBSIDY, CDPR_Rep, CDPR_Rec, PERIN, PEROFF, POST_INDEX, DEBT_START");
	КоличествоКолонок = ДанныеДляВыгрузки.Колонки.Количество();
	Для НомерКолонки = 1 По КоличествоКолонок Цикл
		Таб.Область(1, НомерКолонки).Текст = ДанныеДляВыгрузки.Колонки[НомерКолонки - 1].Имя;
	КонецЦикла;
	
	НомерСтроки = 2;
	Для Каждого Строки Из ДанныеДляВыгрузки Цикл
		Для НомерКолонки = 1 По КоличествоКолонок Цикл
			Таб.Область(НомерСтроки, НомерКолонки).Текст = Строки[НомерКолонки - 1];
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлЕксель(Команда)
	
	
	Таб = Новый ТабличныйДокумент();
	Таб = ВыгрузитьВФайлЕксельНаСервере(Таб);
	Таб.Записать(Объект.Файл, ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕксельПриИзменении(Элемент)
	Если Объект.Ексель Тогда
	    Объект.ХМЛ = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ХМЛПриИзменении(Элемент)
	Если Объект.ХМЛ Тогда
	    Объект.Ексель = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьХМЛНаСервере()
	
	ДанныеДляВыгрузки = Объект.ДанныеВетрины.Выгрузить(,"ROW_NUM, CDPR_Bas, CDPR_Sub, SERVICE_POINT, OSOB, DIV_PER_ACC, EIC, LN_NAME, FN_NAME, SN_NAME, IPN, PASS_SERIAL, PASS_NUMBER, KATOTTG, REGION, DISTRICT, LOCAL_COMMUNITY, SETTLEMENT, STREET, HOUSE, CASE, APT_NUM, APT_FLOOR, HOUSE_FLOOR, PLZAG, PLOPAL, ZONE, ZABORG, RESTRUC, COD, TARIF, REASON, UNITS, BENEFIT, SUBSIDY, CDPR_Rep, CDPR_Rec, PERIN, PEROFF, POST_INDEX");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Объект.Файл, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("query");
	ЗаписьXML.ЗаписатьНачалоЭлемента("external_id");
	ЗаписьXML.ЗаписатьТекст("00001");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("create_date");
	ЗаписьXML.ЗаписатьТекст(Строка(ТекущаяДата()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("row_quantity");
	ЗаписьXML.ЗаписатьТекст(Строка(СтрЗаменить(ДанныеДляВыгрузки.Количество(), Символы.НПП, "")));
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	ЗаписьXML.ЗаписатьНачалоЭлемента("cdpr_bas");
	ЗаписьXML.ЗаписатьТекст(ДанныеДляВыгрузки[0].CDPR_Bas);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	Для Каждого стр Из ДанныеДляВыгрузки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("row");            // Початок рядку
		    ЗаписьXML.ЗаписатьНачалоЭлемента("services");   // Початок послуг
			
			    ЗаписьXML.ЗаписатьНачалоЭлемента("cod");
				ЗаписьXML.ЗаписатьТекст(стр.COD);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("cdpr_sub");
				ЗаписьXML.ЗаписатьТекст(стр.CDPR_Sub);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("service_point");
				ЗаписьXML.ЗаписатьТекст(стр.SERVICE_POINT);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("cdpr_rep");
				ЗаписьXML.ЗаписатьТекст(стр.CDPR_Rep);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("cdpr_rec");
				ЗаписьXML.ЗаписатьТекст(стр.CDPR_Rec);
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("perin");
				ЗаписьXML.ЗаписатьТекст(Строка(Формат(стр.PERIN, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("peroff");
				ЗаписьXML.ЗаписатьТекст(Строка(Формат(стр.PEROFF, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьНачалоЭлемента("debt_start");
				ЗаписьXML.ЗаписатьТекст(Строка(Формат(стр.PEROFF, "ДФ=dd.MM.yyyy")));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("osobs");  // Початок Осбові рахунки
				    ЗаписьXML.ЗаписатьНачалоЭлемента("row_num");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.ROW_NUM));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("eic");
					ЗаписьXML.ЗаписатьТекст(стр.EIC);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("osob");
					ЗаписьXML.ЗаписатьТекст(стр.OSOB);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("div_per_acc");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.DIV_PER_ACC));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("ln_name");
					ЗаписьXML.ЗаписатьТекст(стр.LN_NAME);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("fn_name");
					ЗаписьXML.ЗаписатьТекст(стр.FN_NAME);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("sn_name");
					ЗаписьXML.ЗаписатьТекст(стр.SN_NAME);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("ipn");
					ЗаписьXML.ЗаписатьТекст(стр.IPN);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("pass_serial");
					ЗаписьXML.ЗаписатьТекст(стр.PASS_SERIAL);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("pass_number");
					ЗаписьXML.ЗаписатьТекст(стр.PASS_NUMBER);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("post_index");
					ЗаписьXML.ЗаписатьТекст(стр.POST_INDEX);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("katottg");
					ЗаписьXML.ЗаписатьТекст(стр.KATOTTG);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("region");
					ЗаписьXML.ЗаписатьТекст(стр.REGION);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("district");
					ЗаписьXML.ЗаписатьТекст(стр.DISTRICT);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("local_community");
					ЗаписьXML.ЗаписатьТекст(стр.LOCAL_COMMUNITY);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("settlement");
					ЗаписьXML.ЗаписатьТекст(стр.SETTLEMENT);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("street");
					ЗаписьXML.ЗаписатьТекст(стр.STREET);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("house");
					ЗаписьXML.ЗаписатьТекст(стр.HOUSE);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("case");
					ЗаписьXML.ЗаписатьТекст(стр.CASE);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("apt_num");
					ЗаписьXML.ЗаписатьТекст(стр.APT_NUM);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("apt_floor");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.APT_FLOOR));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("house_floor");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.HOUSE_FLOOR));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("plzag");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.PLZAG));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("plopal");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.PLOPAL));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("zone");
					ЗаписьXML.ЗаписатьТекст(стр.ZONE);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("zaborg");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.ZABORG));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("restruc");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.RESTRUC));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("tarif");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.TARIF));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("reason");
					ЗаписьXML.ЗаписатьТекст(стр.REASON);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("units");
					ЗаписьXML.ЗаписатьТекст(стр.UNITS);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("benefit");
					ЗаписьXML.ЗаписатьТекст(стр.BENEFIT);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("subsidy");
					ЗаписьXML.ЗаписатьТекст(Строка(стр.SUBSIDY));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
				ЗаписьXML.ЗаписатьКонецЭлемента();			// Кінець Особові рахунки
			ЗаписьXML.ЗаписатьКонецЭлемента();              // Кінець послуг
		ЗаписьXML.ЗаписатьКонецЭлемента();                  // Кінець рядка
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьХМЛ(Команда)
	ВыгрузитьХМЛНаСервере();
КонецПроцедуры  

&НаСервере
Функция ДатаНачалаЗадолженностиПоЛицевомуСчету(ЛицевойСчет, Услуга)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга КАК Услуга,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления КАК МесяцНачисления,
	//               |	ВЫБОР
	//               |		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	//               |			ТОГДА NULL
	//               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор
	//               |	КОНЕЦ КАК Регистратор,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодСекунда,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодДень,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодНеделя,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодДекада,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодМесяц,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодКвартал,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодГод,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаОборот КАК Оборот,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Приход,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК Расход,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет.Владелец КАК Здание,
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета
	//               |ИЗ
	//               |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	//               |ГДЕ
	//               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет = &ЛицевойСчет
	//               |	И РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга = &Услуга
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	МесяцНачисления
	//               |АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	//Запрос.УстановитьПараметр("Услуга", Услуга);
	//
	//РезультатВыбора = Запрос.Выполнить().Выгрузить(); 
	//
	//Для Каждого стр Из РезультатВыбора Цикл
	//КонецЦикла;
	
	
КонецФункции
